{
  "jobs": [
    {
      "category": "OPERATIONS",
      "job_code": "TA 0001Y",
      "job_title": "Investment Operations Internship",
      "job_type": "INTERNSHIP",
      "job_description": "Are you looking for a career that helps you apply your love of data, financial analysis, and investments to facilitate business strategy and work with diverse teams on challenging projects? If you are results driven, have a real passion for working with financial data, are deeply analytical and highly creative, then Prudential’s Investment Operations Internship Program is the place for you! Prudential Investment Operations and Systems provides the operations and technology support that contributes to Prudential being a world-class investment manager.",
      "location_city": [
        "NEWARK"
      ],
      "location_state": [
        "NEW JERSEY"
      ],
      "impact": "Are you looking for a career that helps you apply your love of data, financial analysis, and investments to facilitate business strategy and work with diverse teams on challenging projects? Are you passionate about being a part of an exciting internship program that is focused on developing technical and professional skills while collaborating alongside leaders in the asset management community? If you are results driven, have a real passion for working with financial data, are deeply analytical and highly creative, then Prudential’s PGIM Investment Operations Internship Program is the place for you! PGIM Investment Operations and Systems provides the operations and technology support that contributes to PGIM being a world-class investment manager. We supply transaction-level support, generate and report investment results and ensure that our investment results are accurately reflected on our books and records.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021,
          2022
        ],
        "target_majors": [
          "ACT",
          "ECON",
          "FIN"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": false,
        "requires_pc_skills": false,
        "requires_analysis_skills": true,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "TECHNOLOGY",
      "job_code": "TA 0001V",
      "job_title": "Coding/Programming Internship",
      "job_type": "INTERNSHIP",
      "job_description": "Do you aspire to be a world-class programmer? Do you enjoy solving complex challenges and creating unique solutions through your code? As an organization that focuses on both technology and professional development, we encourage aspiring and talented programmers to apply their unique programming skills in our Coding & Software Development Internship. You will collaborate with your peers and our DevOps team in our ongoing efforts to invest in new platforms and capabilities. This internship will challenge you to influence technical direction, develop and review detailed implementation designs, and be accountable for the stability and extendibility of your applications. If you want to apply your knowledge and skills towards an impactful, insightful, and meaningful internship experience, then this is the role for you!",
      "location_city": [
        "NEWARK",
        "SHELTON",
        "ROSELAND",
        "JACKSONVILLE",
        "PLYMOUTH",
        "SUNNYVALE"
      ],
      "location_state": [
        "NEW JERSEY",
        "CONNECTICUT",
        "NEW JERSEY",
        "FLORIDA",
        "MINNESOTA",
        "CALIFORNIA"
      ],
      "impact": "Do you aspire to be a world-class programmer? Do you enjoy solving complex challenges and creating unique solutions through your code? As an organization that focuses on both technology and professional development, we encourage aspiring and talented programmers to apply their unique programming skills in our Coding & Software Development Internship.As a Programming Intern, you will be utilizing various programming languages that include (but are not limited to) Java, C++, Python, .Net (VB, C#, ASP), JavaScript, HTML, XML/XSL, SQL, or Batch Scripting. You will collaborate with your peers and our DevOps team in our ongoing efforts to invest in new platforms and capabilities. This internship will challenge you to influence technical direction, develop and review detailed implementation designs, and be accountable for the stability and extendibility of your applications. Your code will be held to a high-standard, and we will seek your knowledge of the latest technologies to enhance how we engage our customer and execute our objectives. Your creativity in solving complex problems will be an asset that every business unit can leverage; thus, providing you with the opportunity to define the career you want to lead. Your projects will support a variety of Finance and Technology initiatives impacting multiple business groups and functions. If you want to apply your knowledge and skills towards an impactful, insightful, and meaningful internship experience, then this is the role for you! We offer highly competitive compensation and housing/transportation stipends if the job requires you to move geographically.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021,
          2022,
          2023
        ],
        "target_majors": [
          "CS",
          "CE",
          "MATH"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": true,
        "requires_management_skills": false,
        "requires_pc_skills": true,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "TECHNOLOGY",
      "job_code": "TA 0001S",
      "job_title": "Information Technology Internship Program",
      "job_type": "INTERNSHIP",
      "job_description": "Are you a freshman, sophomore, or junior looking to put your technical skills to use in a business environment? If you have strong analytical skills, are eager to learn, and able to troubleshoot to resolve complex issues utilizing outside-the-box thinking and unique perspectives, then this is the role for you! Many teams across Prudential are dedicated to delivering world-class technology and strategic solutions that help every one of our business units deliver in a competitive global landscape. Our technology internships will leverage the knowledge, skills and abilities that you have obtained through your academic studies to help solve some of our biggest challenges.",
      "location_city": [
        "NEWARK",
        "SHELTON",
        "ROSELAND",
        "JACKSONVILLE",
        "PLYMOUTH",
        "DRESHER"
      ],
      "location_state": [
        "NEW JERSEY",
        "CONNECTICUT",
        "NEW JERSEY",
        "FLORIDA",
        "MINNESOTA",
        "PENNSYLVANIA"
      ],
      "impact": "Are you a freshman, sophomore, or junior looking to put your technical skills to use in a business environment? Or maybe you’re looking to gain foundational technical knowledge/skills to apply in a professional environment, while developing strong relationships through training, mentorship, and ongoing feedback. If you have strong analytical skills, are eager to learn, and able to troubleshoot to resolve complex issues utilizing outside-the-box thinking and unique perspectives, then this is the role for you! Many teams across Prudential are dedicated to delivering world-class technology and strategic solutions that help every one of our business units deliver in a competitive global landscape. Our technology internships will leverage the knowledge, skills and abilities that you have obtained through your academic studies to help solve some of our biggest challenges. Your creativity will help us build the world in which we operate, conduct business, and serve our clients across the globe. As an Information Technology Intern, you will collaborate closely with fellow technologists, managers and mentors. You will be tasked with automating existing processes and may be exposed to cloud technology, serverless computing, virtual networking and machine learning. You will be given substantial responsibilities and will have opportunity to present your newly learned skills to your team during this 10-week experience. We offer highly competitive compensation and housing/transportation stipends if the job requires you to move geographically.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021,
          2022,
          2023
        ],
        "target_majors": [
          "IT",
          "CE",
          "CS",
          "EE",
          "MATH"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": true,
        "requires_management_skills": false,
        "requires_pc_skills": true,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "TECHNOLOGY",
      "job_code": "TA 0001U",
      "job_title": "Data Analytics and Business Systems Internship",
      "job_type": "INTERNSHIP",
      "job_description": "Are you a freshman, sophomore, or junior looking to put your data analytics skills to use in a business setting? Do you want to work with experienced professionals and subject matter experts to help you develop your technical skillset? If this sounds like you, that’s a challenge we can help you meet as a member of our Data Analytics Internship Program. We are looking for top-performing students who excel at analytical problem solving. As a Data Analyst, you will improve business initiatives through operational enhancement while aligning our technical capabilities towards efficient and strategic business solutions. Come join us for an insightful and personalized summer internship experience.",
      "location_city": [
        "NEWARK",
        "SHELTON",
        "ROSELAND",
        "PLYMOUTH"
      ],
      "location_state": [
        "NEW JERSEY",
        "CONNECTICUT",
        "NEW JERSEY",
        "MINNESOTA"
      ],
      "impact": "Are you a freshman, sophomore, or junior looking to put your data analytics skills to use in a business setting? Are you organized, analytical in nature, and looking to thrive in a collaborative/dynamic work environment? Do you want to work with experienced professionals and subject matter experts to help you develop your technical skillset? If this sounds like you, that’s a challenge we can help you meet as a member of our Data Analytics Internship Program. Data is widely-recognized as a critical enterprise resource in today’s business technology environment. We are looking for top-performing students who excel at analytical problem solving. As a Data Analyst, you will improve business initiatives through operational enhancement while aligning our technical capabilities towards efficient and strategic business solutions. Your work will help us move beyond the numbers—and on to the narrative of what is happening, why it is happening and where things are likely to go in the future. Beyond your day-to-day work, you’ll have the opportunity to provide new perspectives and are excited about Prudential’s culture of giving back to the communities where we live and work. Come join us for an insightful and personalized summer internship experience. As part of our hiring process, we will help match you with the team or business group that is the best fit for your skills and your unique professional goals. We offer highly competitive compensation and housing/transportation stipends if the job requires you to move geographically.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021,
          2022,
          2023
        ],
        "target_majors": [
          "MIS",
          "BMGT",
          "BAIT",
          "STATS",
          "BANAL"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": true,
        "requires_management_skills": false,
        "requires_pc_skills": true,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "TECHNOLOGY",
      "job_code": "TA 0001X",
      "job_title": "Product Managment Internship",
      "job_type": "INTERNSHIP",
      "job_description": "Are you a highly organized and ambitious student who wants to put your technical and product management skills to use in a business environment? If you have a passion for Product Management, want to learn & communicate new ideas to a professional audience, and drive challenging projects end-to-end, then this is the internship for you! Our Product Management Program invites financial technology, design, and technical enthusiasts to help build, optimize and deliver platforms for Prudential Financials’ global businesses. Your creativity helps build the world in which we operate, conduct business, and serve our clients across the globe.",
      "location_city": [
        "SUNNYVALE",
        "NEWARK"
      ],
      "location_state": [
        "CALIFORNIA",
        "NEW JERSEY"
      ],
      "impact": "Are you a highly organized and ambitious student who wants to put your technical and product management skills to use in a business environment? Are you looking to expand your abilities and perspective by working with diverse teams on challenging projects and build relationship with experts/leaders in the field? If you have a passion for Product Management, want to learn & communicate new ideas to a professional audience, and drive challenging projects end-to-end, then this is the internship for you! Our Product Management Program invites financial technology, design, and technical enthusiasts to help build, optimize and deliver platforms for Prudential Financials’ global businesses. Your creativity helps build the world in which we operate, conduct business, and serve our clients across the globe. This role resides in Prudential’s Customer Office, a group building a startup culture in a 140+ year old company that is touching 20 Million+ lives, yet thinks agile. A company where talent drives success and your work touches everyone, from a 25-year old to folks over 90 years old living in retirement. We care about web accessibility. We care how we treat our customers. Our employees are passionate about what they do and make it happen. We offer highly competitive compensation and housing/transportation stipends if the job requires you to move geographically.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021,
          2022,
          2023
        ],
        "target_majors": [
          "FIN",
          "CE",
          "MATH",
          "IT"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": true,
        "requires_pc_skills": true,
        "requires_analysis_skills": true,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "TECHNOLOGY",
      "job_code": "TA 00020",
      "job_title": "Coding/Programming Associate",
      "job_type": "FULL_TIME",
      "job_description": "Do you aspire to be a world-class programmer? Do you enjoy solving complex challenges and creating unique solutions through your code? As an organization that focuses on both technology and professional development, we encourage aspiring and talented programmers to apply their unique programming skills in our Coding & Software Development Associate Program. This position will challenge you to influence technical direction, develop and review detailed implementation designs, and be accountable for the stability and extendibility of your applications.If you want to apply your knowledge and skills towards an impactful, insightful, and meaningful experience, then this is the role for you!",
      "location_city": [
        "NEWARK"
      ],
      "location_state": [
        "NEW JERSEY"
      ],
      "impact": "Do you aspire to be a world-class programmer? Do you enjoy solving complex challenges and creating unique solutions through your code? As an organization that focuses on both technology and professional development, we encourage aspiring and talented programmers to apply their unique programming skills in our Coding & Software Development Associate Program. As a Programming Associate, you will be utilizing various programming languages that include (but are not limited to) Java, C++, Python, .Net (VB, C#, ASP), JavaScript, HTML, XML/XSL, SQL, or Batch Scripting. You will collaborate with your peers and our DevOps team in our ongoing efforts to invest in new platforms and capabilities. This position will challenge you to influence technical direction, develop and review detailed implementation designs, and be accountable for the stability and extendibility of your applications. Your code will be held to a high-standard, and we will seek your knowledge of the latest technologies to enhance how we engage our customer and execute our objectives. Your creativity in solving complex problems will be an asset that every business unit can leverage; thus, providing you with the opportunity to define the career you want to lead. Your projects will support a variety of Finance and Technology initiatives impacting multiple business groups and functions. If you want to apply your knowledge and skills towards an impactful, insightful, and meaningful experience, then this is the role for you!",
      "qualifications": {
        "target_grad_year": [
          2019,
          2020
        ],
        "target_majors": [
          "CS",
          "CE",
          "MATH"
        ],
        "min_gpa": 3.3,
        "requires_math_skills": false,
        "requires_cs_skills": true,
        "requires_management_skills": false,
        "requires_pc_skills": true,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "TECHNOLOGY",
      "job_code": "TA 00022",
      "job_title": "Infrastructure Systems Development (Mainframe) Internship Program",
      "job_type": "INTERNSHIP",
      "job_description": "Are you looking to gain foundational technical Mainframe knowledge to apply in a professional environment, while developing strong relationships through training, mentorship, and ongoing feedback? If you have strong analytical skills, are eager to learn, and able to troubleshoot to resolve complex issues utilizing outside-the-box thinking and unique perspectives, then this Mainframe focused role is for you! Our technology internships will leverage the knowledge, skills and abilities that you have obtained through your academic studies to help solve some of our biggest challenges on the Mainframe platform. As an Infrastructure Systems Development Intern, you will work closely with senior developers, managers and mentors.",
      "location_city": [
        "NEWARK"
      ],
      "location_state": [
        "NEW JERSEY"
      ],
      "impact": "Are you looking to gain foundational technical Mainframe knowledge to apply in a professional environment, while developing strong relationships through training, mentorship, and ongoing feedback? If you have strong analytical skills, are eager to learn, and able to troubleshoot to resolve complex issues utilizing outside-the-box thinking and unique perspectives, then this Mainframe focused role is for you! Our technology internships will leverage the knowledge, skills and abilities that you have obtained through your academic studies to help solve some of our biggest challenges on the Mainframe platform. Your creativity will help us build the world in which we operate, conduct business, and serve our clients across the globe. As an Infrastructure Systems Development Intern, you will work closely with senior developers, managers and mentors. You will be exposed to various components of systems development lifecycle (SDLC), as well as systems concepts including administration of file systems spanning various operating systems, utilization of sophisticated and powerful API's, and a deep understanding of Mainframe and UNIX operating system fundamentals. With most Fortune 500 companies using mainframes, “big iron” requires skilled system developers with a firm knowledge of computer science topics ranging from TCP/IP networking, common scripting languages, full stack administration, JAVA to more mainframe focused programming languages such as Job Control Language (JCL) and Restructured Extended Executor (REXX). While learning on one of the most powerful and reliable platforms in enterprise architecture, you will be shown the strategies, hardware, and software supporting the enterprises on forefront of technology and business since 1951. We offer highly competitive compensation and housing/transportation stipends if the job requires you to move geographically.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021,
          2022,
          2023
        ],
        "target_majors": [
          "CS",
          "CE",
          "MATH",
          "IT"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": true,
        "requires_management_skills": false,
        "requires_pc_skills": true,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "SALES",
      "job_code": "ISG0003D",
      "job_title": "Individual Life Insurance Service Experience Internship",
      "job_type": "INTERNSHIP",
      "job_description": "Do you have the drive to achieve above and beyond expectations and a passion to help people? Are you highly motivated, analytical, and looking to thrive in a fast-paced environment? If you have the desire and vision to think creatively and are results driven, then the Service Experience internship on the Individual Life Insurance team is for you!",
      "location_city": [
        "JACKSONVILLE"
      ],
      "location_state": [
        "FLORIDA"
      ],
      "impact": "Do you have the drive to achieve above and beyond expectations and a passion to help people? Are you highly motivated, analytical, and looking to thrive in a fast-paced environment? If you have the desire and vision to think creatively and are results driven, then the Service Experience internship on the Individual Life Insurance team is for you! During the 10-week internship, you will have the opportunity to rotate within the following 3 functions of Individual Life Insurance: Customer Value Center: optimizes the profitability of Prudential’s enforce life insurance policies and cultivates customer advocates through targeted customer retention and client-initiated sales. New Business Case Management: supports distribution partners in selling Life Insurance through case coordination, relationship-based service, and process education. Compensation Operations: administers compensation programs for Prudential Advisors and maintains all producer information to ensure timely and accurate payments bi-weekly.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021,
          2022
        ],
        "target_majors": [
          "ALL"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": true,
        "requires_pc_skills": true,
        "requires_analysis_skills": true,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "SALES",
      "job_code": "NSD000AP",
      "job_title": "Individual Solutions Group Sales Internship",
      "job_type": "INTERNSHIP",
      "job_description": "Are you looking for a career that utilizes your ability to solve for complex challenges, uncover opportunities to drive value and work with diverse teams on challenging projects?  If you are an innovative, entrepreneurial thinker, looking to expand your financial knowledge and have a passion for closing business deals than a Sales Internship as part of the Individuals Solutions Group is for you! Individual Solutions provides financial advice and develops, distributes and services annuities, life insurance and other outcome-oriented solutions for consumers.",
      "location_city": [
        "PLYMOUTH",
        "DRESHER",
        "SHELTON"
      ],
      "location_state": [
        "MINNESOTA",
        "PENNSYLVANIA",
        "CONNECTICUT"
      ],
      "impact": "Are you looking for a career that utilizes your ability to solve for complex challenges, uncover opportunities to drive value and work with diverse teams on challenging projects? Are you interested in being a part of an exciting internship experience that is focused on developing technical and leadership skills while collaborating alongside leaders in the Prudential community? If you are an innovative, entrepreneurial thinker, looking to expand your financial knowledge and have a passion for closing business deals then a Sales Internship as part of the Individuals Solutions Group is for you! Individual Solutions provides financial advice and develops, distributes and services annuities, life insurance and other outcome-oriented solutions for consumers. The group is comprised of Prudential Annuities, Prudential Individual Life Insurance and Prudential Advisors. The Individual Solutions Sales Intern will work in the Annuities or Individual Life Insurance business.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021
        ],
        "target_majors": [
          "ECON",
          "FIN"
        ],
        "min_gpa": 3.2,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": false,
        "requires_pc_skills": false,
        "requires_analysis_skills": true,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "ACTUARIAL",
      "job_code": "ACT000RC",
      "job_title": "Actuarial Success Awareness Program",
      "job_type": "EXTERNSHIP",
      "job_description": "Are you a freshman or sophomore student majoring in actuarial science, mathematics, or statistics looking to diversify your skillset, learn more about the insurance & financial services industry, and open several career doors along the way? Then Prudential’s Actuarial Success Awareness Program  is the place for you! The Actuarial Success Awareness Program is a 1-week experience that is designed to expose strong mathematics students to a career in the Actuarial profession.",
      "location_city": [
        "NEWARK"
      ],
      "location_state": [
        "NEW JERSEY"
      ],
      "impact": "Are you a freshman or sophomore student majoring in actuarial science, mathematics, or statistics looking to diversify your skillset, learn more about the insurance & financial services industry, and open several career doors along the way? Are you interested in being a part of an exciting development program that is focused on professional skills training, working with diverse teams on exciting projects, and building relationships with leaders in the actuarial community? Then Prudential’s Actuarial Success Awareness Program (ASAP) is the place for you! The Actuarial Success Awareness Program (ASAP) is a 1-week experience that takes place in May 2020 and is designed to expose strong mathematics students to a career in the Actuarial profession. The program is open to freshmen and sophomore students from all backgrounds.",
      "qualifications": {
        "target_grad_year": [
          2021,
          2022,
          2023
        ],
        "target_majors": [
          "AS",
          "MATH",
          "STATS",
          "CS"
        ],
        "min_gpa": 3.2,
        "requires_math_skills": true,
        "requires_cs_skills": true,
        "requires_management_skills": false,
        "requires_pc_skills": true,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "ASSET_MANAGEMENT",
      "job_code": "INV000F6",
      "job_title": "Strategic Investment Research Internship Program",
      "job_type": "INTERNSHIP",
      "job_description": "Are you looking for a career that helps you apply your love of finance, research, and asset management to strengthen business strategy and work with diverse teams on challenging projects? If you are results driven, have a real passion for working with data, and are a strong communicator and highly creative, then Prudential Investments is the place for you! The Strategic Investment Research Group within Prudential Investments, is a group of highly trained experts, and specialized analysts who devote their full attention to knowing and understanding the players in the global money management community.",
      "location_city": [
        "NEWARK"
      ],
      "location_state": [
        "NEW JERSEY"
      ],
      "impact": "Are you looking for a career that helps you apply your love of finance, research, and asset management to strengthen business strategy and work with diverse teams on challenging projects? Are you passionate about being a part of an exciting internship program that is focused on developing technical and professional skills while collaborating alongside leaders in the Investment community? If you are results driven, have a real passion for working with data, and are a strong communicator and highly creative, then PGIM Investments is the place for you! The Strategic Investment Research Group (SIRG) within PGIM Investments, is a group of highly trained experts, and specialized analysts who devote their full attention to knowing and understanding the players in the global money management community. SIRG was founded over 30 years ago to serve Prudential Financials’ wealth management divisions. Today SIRG provides services to a wide range of Prudential Financials’ businesses, ranging from basic research and reporting to full-service platform consulting and discretionary multi-manager portfolio management.",
      "qualifications": {
        "target_grad_year": [
          2021,
          2022
        ],
        "target_majors": [
          "FIN",
          "ECON",
          "ACT"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": false,
        "requires_pc_skills": true,
        "requires_analysis_skills": true,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "ASSET_MANAGEMENT",
      "job_code": "PCG0007K",
      "job_title": "Summer Investment Analyst: Prudential Private Capital",
      "job_type": "INTERNSHIP",
      "job_description": "Are you a rising junior looking to apply your analytical knowledge and make an impact within a dynamic, evolving organization? As a Summer Analyst, you would work on a small deal team responsible for underwriting, portfolio monitoring and marketing and contribute analytical and written content as part of the investment process over your 10-week summer internship.",
      "location_city": [
        "CHICACO",
        "LOS ANGELES",
        "ATLANTA",
        "DALLAS",
        "SAN FRANCISCO",
        "NEW YORK"
      ],
      "location_state": [
        "ILLINOIS",
        "CALIFORNIA",
        "GEORGIA",
        "TEXAS",
        "NEW YORK"
      ],
      "impact": "Are you a rising junior looking to apply your analytical knowledge and make an impact within a dynamic, evolving organization? Or maybe you’re looking to gain foundational knowledge and skills to apply in a professional environment, while developing strong relationships through training, mentorship, and ongoing feedback. At Prudential Private Capital that’s a challenge we can help you meet as a Summer Investment Analyst. As a Summer Analyst, you would work on a small deal team responsible for underwriting, portfolio monitoring and marketing and contribute analytical and written content as part of the investment process over your 10-week summer internship. You will learn about investing private placements of senior debt, subordinated debt, and equity capital, gaining valuable experience in thinking like a long-term investor, as well as applying accounting and finance fundamentals. You will also participate in an eight-week, in-house training program throughout the internship.",
      "qualifications": {
        "target_grad_year": [
          2021
        ],
        "target_majors": [
          "ALL"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": false,
        "requires_pc_skills": false,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "ASSET_MANAGEMENT",
      "job_code": "PCG0007N",
      "job_title": "Investment Analyst: Prudential Private Capital",
      "job_type": "FULL_TIME",
      "job_description": "Are you a rising senior looking to apply your analytical knowledge and make an impact within a dynamic, evolving organization? As an Investment Analyst, you would work on a small deal team responsible for underwriting, portfolio monitoring and marketing, while getting the chance to develop your analytical skills and learn to think like a buy-and-hold investor in a three-year analyst program. You will learn about investing private placements of senior debt and junior capital within a variety of industries from large, multi-national companies to smaller, privately-held companies.",
      "location_city": [
        "CHICACO",
        "LOS ANGELES",
        "ATLANTA",
        "DALLAS",
        "SAN FRANCISCO",
        "NEW YORK"
      ],
      "location_state": [
        "ILLINOIS",
        "CALIFORNIA",
        "GEORGIA",
        "TEXAS",
        "NEW YORK"
      ],
      "impact": "Are you a rising senior looking to apply your analytical knowledge and make an impact within a dynamic, evolving organization? Or maybe you’re looking to gain foundational knowledge and skills to apply in a professional environment, while developing strong relationships through training, mentorship, and ongoing feedback. At Prudential Private Capital that’s a challenge we can help you meet as an Investment Analyst. As an Investment Analyst, you would work on a small deal team responsible for underwriting, portfolio monitoring and marketing, while getting the chance to develop your analytical skills and learn to think like a buy-and-hold investor in a three-year analyst program. You will learn about investing private placements of senior debt and junior capital within a variety of industries from large, multi-national companies to smaller, privately-held companies. Many of our analysts move on to attend top business schools and have received a variety of opportunities within the industry at the close of the three-year Investment Analyst program.",
      "qualifications": {
        "target_grad_year": [
          2020
        ],
        "target_majors": [
          "ALL"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": false,
        "requires_pc_skills": false,
        "requires_analysis_skills": true,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "OPERATIONS",
      "job_code": "TA 0001Z",
      "job_title": "Investment Operations Associate",
      "job_type": "FULL_TIME",
      "job_description": "Are you looking for a career that helps you apply your love of data, financial analysis, and investments to facilitate business strategy and work with diverse teams on challenging projects? If you are results driven, motivated, have a real passion for working with financial data, are deeply analytical and highly creative, then Prudential’s Investment Operations Associate role is the position for you! Prudential Investment Operations and Systems provides the operations and technology support that contributes to Prudential being a world-class investment manager.",
      "location_city": [
        "NEWARK"
      ],
      "location_state": [
        "NEW JERSEY"
      ],
      "impact": "Are you looking for a career that helps you apply your love of data, financial analysis, and investments to facilitate business strategy and work with diverse teams on challenging projects? Are you passionate about pursuing a full-time Associate role that is focused on developing technical and professional skills while collaborating alongside leaders in the asset management community? If you are results driven, motivated, have a real passion for working with financial data, are deeply analytical and highly creative, then Prudential’s PGIM Investment Operations Associate role is the position for you! PGIM Investment Operations and Systems provides the operations and technology support that contributes to PGIM being a world-class investment manager. We supply transaction-level support, generate and report investment results and ensure that our investment results are accurately reflected on our books and records.",
      "qualifications": {
        "target_grad_year": [
          2019,
          2020
        ],
        "target_majors": [
          "ACT",
          "ECON",
          "FIN"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": false,
        "requires_pc_skills": false,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "OPERATIONS",
      "job_code": "GRO000CB",
      "job_title": "Workplace Solutions Group - Group Insurance Health and Productivity Internship",
      "job_type": "INTERNSHIP",
      "job_description": "Are you looking for a career that helps you apply your energy, curiosity and initiative to help solve some of Prudential’s business challenges? If you are an innovative, self-starter looking to continuously improve things and creatively solve problems, then a Health and Productivity Internship within the Workplace Solutions Group is for you.",
      "location_city": [
        "PORTLAND"
      ],
      "location_state": [
        "MAINE"
      ],
      "impact": "Are you looking for a career that helps you apply your energy, curiosity and initiative to help solve some of Prudential’s business challenges? Are you interested in working with diverse teams on projects that add value and have an impact to our business priorities? Are interested in learning how to improve the productivity and health of the workforce? If you are an innovative, self-starter looking to continuously improve things and creatively solve problems, then a Health and Productivity Internship within the Workplace Solutions Group (WSG) is for you. The Health and Productivity Analytics and Consulting practice is housed with WSG group insurance and works with employers to help them maximize productivity and minimize absence through data analysis that leads to actionable solutions. We also perform research on emerging workforce challenges and design projects that identify real time actionable solutions to these challenges.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021
        ],
        "target_majors": [
          "ALL"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": false,
        "requires_pc_skills": false,
        "requires_analysis_skills": true,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "PROJECT MANAGEMENT",
      "job_code": "TA 0001T",
      "job_title": "Project Management & Business Solutions Internship",
      "job_type": "INTERNSHIP",
      "job_description": "Do you aspire to be a Project Manager or Business Solutions Specialist? Do you enjoy solving problems? We are looking for aspiring Project Managers to help solve some of Prudential’s biggest challenges by aligning our technical initiatives towards efficient and strategic business solutions. In this role, your creativity in developing solutions to complex problems will be an asset that every business unit can leverage. If you want to help solve some of Prudential’s biggest challenges by aligning our technical initiatives towards efficient and strategic business solutions, then this is the role for you!",
      "location_city": [
        "NEWARK",
        "ROSELAND"
      ],
      "location_state": [
        "NEW JERSEY"
      ],
      "impact": "Do you aspire to be a Project Manager or Business Solutions Specialist? Do you enjoy solving problems? We are looking for aspiring Project Managers to help solve some of Prudential’s biggest challenges by aligning our technical initiatives towards efficient and strategic business solutions. In this role, your creativity in developing solutions to complex problems will be an asset that every business unit can leverage; thus, providing you with the opportunity to define the career you want to lead. We are looking for highly organized students who are excited about the opportunity to support various business functions in executing goals by managing strategic projects and providing consultative support. You know how to take initiative and probe for further information when solving problems. You can make quick and effective decisions based on your analysis to produce workable solutions towards a range of problems. Our Project Management and Business Solutions interns are a part of the entire process, and they serve as a liaison between business partners and technologists. Your projects will support a variety of Finance and Technology initiatives impacting multiple business groups and functions. If you want to help solve some of Prudential’s biggest challenges by aligning our technical initiatives towards efficient and strategic business solutions, then this is the role for you!",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021,
          2022,
          2023
        ],
        "target_majors": [
          "BMGT",
          "ECON",
          "BANAL",
          "STATS",
          "COMM",
          "MIS"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": false,
        "requires_pc_skills": true,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "SALES",
      "job_code": "CO 00042",
      "job_title": "Customer Office BYCP Sales & Service Internship",
      "job_type": "INTERNSHIP",
      "job_description": "Do you have the drive to achieve above and beyond expectations and a passion to help people? Are you highly motivated, analytical, and looking to thrive in a fast-paced environment? If you have the desire and vision to think creatively and are results driven, then the Customer Office Internship is for you! The Prudential Customer Office team’s mission is to deliver needs-based, human-centric experiences across all customer touch points at Prudential.",
      "location_city": [
        "PLYMOUTH"
      ],
      "location_state": [
        "MINNESOTA"
      ],
      "impact": "Do you have the drive to achieve above and beyond expectations and a passion to help people? Are you highly motivated, analytical, and looking to thrive in a fast-paced environment? If you have the desire and vision to think creatively and are results driven, then the Customer Office Internship is for you! The Prudential Customer Office team’s mission is to deliver needs-based, human-centric experiences across all customer touchpoints at Prudential. We do this by strategically leveraging marketing, technology, data and intelligent experimentation to serve the needs of customers and offer the right solutions at the right time to meet their life goals.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021
        ],
        "target_majors": [
          "ALL"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": false,
        "requires_pc_skills": false,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    },
    {
      "category": "MARKETING",
      "job_code": "PGI0009T",
      "job_title": "Executive Marketing Summer Analyst",
      "job_type": "INTERNSHIP",
      "job_description": "We are currently looking for a rising sophomore or junior to join our team as a Summer Intern. As an intern, you will be part of a small, marketing team overseen by the Chief Administrative Officer of Prudential. You will be given high levels of responsibility and asked to engage in complex business/marketing challenges from day one. These projects will provide you with exposure to PGIM and the asset management industry, and you will begin to develop a broad business marketing toolkit.",
      "location_city": [
        "NEWARK"
      ],
      "location_state": [
        "NEW JERSEY"
      ],
      "impact": "We are currently looking for a rising sophomore or junior to join our team as a Summer Intern. As an intern, you will be part of a small, marketing team overseen by the Chief Administrative Officer who reports directly to the President and CEO of PGIM. You will be given high levels of responsibility and asked to engage in complex business/marketing challenges from day one. Throughout the ten-weeks, we will have you working on a wide range of projects that will have a strong impact PGIM’s brand. You may be asked to research global trends, industry awards, global conferences and other financial publications to evaluate PGIM’s position in the business market in comparison to other asset management businesses. These projects will provide you with exposure to PGIM and the asset management industry, and you will begin to develop a broad business marketing toolkit. In addition to conducting research and analysis, you will be responsible for presenting your findings and recommendations to senior management.",
      "qualifications": {
        "target_grad_year": [
          2020,
          2021,
          2022
        ],
        "target_majors": [
          "MKT",
          "COMM"
        ],
        "min_gpa": 3.0,
        "requires_math_skills": false,
        "requires_cs_skills": false,
        "requires_management_skills": false,
        "requires_pc_skills": false,
        "requires_analysis_skills": false,
        "requires_datascience_skills": false
      }
    }
  ]
}
